# all variables are included  here 

class Variables:
    ALLOWED_CHATS = ['@Wase_Records_Group']
    TELEBIRR_PHONE = '940106240' #payment mekebeya slkhn 
    INVITATION_LINK = "https://t.me/wase_records_bot?start=ref{}"
    MONGODB  = "mongodb+srv://ZidanXarg:ZidanXarg@cluster0.sdxxonl.mongodb.net/?retryWrites=true&w=majority"
    OWNERS = [689467742,2069970688] #list naw eskefelek
    MUST_JOIN = """🍿ከቦቱ ትርጉም ፊልሞችን ለመውሰድ በቅድሚያ ቻናላችንን መቀላቀል አለቦት።
~> ከታች ለመቀላቀል ሚለውን በተን ተጭነው ይቀላቀሉ👇🏻"""
    MUST_JOIN_INVITED = """🍿ከቦቱ ትርጉም ፊልሞችን ለመውሰድ በቅድሚያ ቻናላችንን መቀላቀል አለቦት።
~> ከታች ለመቀላቀል ሚለውን በተን ተጭነው ይቀላቀሉ👇🏻
~> ከተቀላቀሉ በሆላ ተቀላቅያለው ምትለውን በተን በመጫን መቀላቀሎትን ያረጋግጡ👇🏻"""
    YOU_DECLINED_IT = "❌ክፍያውን ሰርዘሀል።"
    FAILED_PAYMENT = "❌ክፍያውን ማረጋገጥ አልተቻለም ፤ ስህተት ነው ብለዉ ካሰቡ @The_hacker_person ያናግሩን።"
    YOU_APPROVED_IT = "✅ክፍያውን አረጋግጠሀል"
    SUCCESS_PAYMENT = "🎉ክፍያውን በተሳካ ሁኔታ ከፍለዋል፤ እባኮ ቀሪ ሂሳቦን ያረጋግጡ።"
    NOT_ENOUGH = "📭 ፊልም ለመግዛት የሚበቃ ሂሳብ የሎትም እባኮ ሂሳብ ለመሙላት ሚለውን ቁልፍ ተጭነው ክፍያ ይፈፅሙ።"
    ALREADY_USER = 'ሠሠሠሠሠሠሠሠ'
    BUTTON = "button" #zm biye naw ke source gar tastekakilewalek
    URL = "https://t.me/+qZXWNtb0C0xiNjU0" # ihem indezaw
    CAST_UI = "የሚለቀቀውን ነገር ላክልኝ!" #
    ASKEM_PAY_TELEBIRR = """🍀 እባኮ ከታች ባለው የቴሌብር አካውንት ቁጥር መሙላት የፈለጉትን ብር ካስገቡ በሆላ ከቴሌብር የሚደርሶትን ሚሴጅ ይላኩልኝ።
    
⨳ ከሚደርሳቹ ሚሴጅ ውስጥ { የሂሳብ እንቅስቃሴ ቁጥሮ } ከምትለው አጠገብ { AJB3WB3IE5 } ይሄን የምትመስል ኮድ አለች ምንም ሳይጨምሩ እሶን ብቻ ፅፈው ይላኩልኝ።
🍀Telebirr ~> 0940106240"""
    ASKEM_PAY_CARD = """ብር ከታች ባለው ስልክ ቁጥር ከላኩ በሆላ ከቴሌ የሚደርሶትን ሚሴጅ ስክሪንሻት {ፎቶ አንስተው} ይላኩልኝ!
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~
🍀ኢትዮቴሌኮም~> 0940106240
🍀ሳፋሪኮም~> 0713378650
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~"""
    CANCELED = "ትክክል ያልሆነ መረጃ ስለላኩ የክፍያ ሂደቱ ተቋርጦል ፤ ደግመው ክፍያ ለመፈፅም ካሰቡ /buy ብለው ያስጀምሩ" 
    WELCOME = """👨🏻‍✈️ ሰላም {} እኔ ትርጉም ፊልሞችን የምሰጥ ቦት ነኝ።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~
🧧 እዚህ ሁሉንም አይነት ትርጉም ፊልሞች ማግኘት ይችላሉ።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~
🧧 ከርሶ ሚጠበቀው የፊልም ስም ፊደል ሳይሳሳቱ መላክ ብቻ ነው።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~"""
    FILM_SOURCE_CHANNEL = -1001850882727
    FORCE_CHANNEL_ID = [] #list naw iskefelek memulat tchlalek
    OWNERS_ID = 689467742
    FILM_AMOUNT = "🍀 መሙላት የሚፈልጉትን የብር መጠን ይላኩ?"
    PHONE_NUMBER = "☎️ እባኮ የእርሶን ስልክ ቁጥር ይላኩልኝ?"
    CANCELLED = "❗️ትክክል ያልሆነ መረጃ ስለላኩ የክፍያ ሂደቱ ተቋርጦል ፤ ደግመው ክፍያ ለመፈፅም ካሰቡ /buy ብለው ያስጀምሩ"
    RESULT_NOT_FOUND = "❌የፈለጉትን ፊልም ማግኘት አልተቻለም እባኮ ስፔሊንግ አስተካክለው እንደገና ይሞክሩ!"
    PENDING_PAY = "🍿ክፍያው በ30 ደቂቃ ዉስጥ ተረጋግጦ መልክት ይደርሶታል።"
    NOT_ENOUGH = "📭 ፊልም ለመግዛት የሚበቃ ሂሳብ የሎትም እባኮ ሂሳብ ለመሙላት ሚለውን ቁልፍ ተጭነው ክፍያ ይፈፅሙ።"
    BALANCE_CHECK = "💵ያሎት ቀሪ ሂሳብ {} ብር ነው"
    BANNED_USER = """🧨ለማጭበርበር በመሞከር ወይም አላስፈላጊ መልእክቶች በመላኮ ምክንያት ቦቱን እንዳይጠቀሙ ታግደዋል!
🧮መለቀቅ ከፈለጉ 15 ብር ከፍለው መለቀቅ ይችላሉ።
ከፍለው ለመለቀቅ ፍቃደኛ ከሆኑ @The_hacker_person ላይ ያናግሩኝ!"""
    API_ID = 9583161 
    HELP_MESSAGE = """☘ ማዘዣዎች!
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  ~  ~ ~ ~ 
☘ /start ~> ለማስጀመር ወይም ሪስታርት ለማረግ።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  ~  ~ ~ ~ 
☘ /help ~> ይሄን ሚሴጅ ለማግኘት።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  ~  ~ ~ ~ 
☘ /buy ~> ሂሳብ ለመሙላት።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  ~  ~ ~ ~ 
☘ /balance ~> ቀሪ ሂሳብ ለማወቅ።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  ~  ~ ~ ~ 
☘ /refferal ~> መጋበዣ ሊንክ ለመቀበል።
~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  ~  ~ ~ ~"""
    SEARCH_PENDING = "♻️በፍለጋ ላይ ትንሽ ይጠብቁ።"
    LOG_CHANNEL = -1001902316151
    API_HASH = "aecf9e2b7c655c4f916564ab6d598a73" 
    BOT_TOKEN = "1076518145:AAGXhwclMG3kgBzREnkhshbr5cc366qJQY0"
    BOT_ID = 1076518145
    SESSION = "BABc415oWHG30_c56ezBH8gRUfXd8c0dHF1DvZyZjoTDjPT03mBSeQh5V2CeWjU9mBdZld4dVtSioxvbnafKn8_crN4CuCDKozwfW0mF2DgjxdDrEzsqMinYl-AAKq9en_DzV4gN0a5lr3V695pU18uuwzXwZeW3M6EB7YZCtvwsiKXEzAQ28fFDRGrXi0ivyoaWVUAZFQFgPOi9hqDX2_VyY6k_MaAskzSTmxIHc8Op-XYevu2cqHseHsNvHnwDvaAHoRfT4K09WE8RpToajaeZr5ggGy2ei8yFAoenQQLiwN2JQSv6Y3vndyVavY7BpV-MeYmjKIg36xdhu-I670SxAAAAATzprmMA"
    FAQS = """🔴 ተደጋጋሚ ጥያቄዎች!

1, እንዴት ነው ፊልም ማወርደው?
         ⨳ ፊልም ለማውረድ የፊልሙን ስም ፅፈው ቀጥታ ለቡቱ መላክ!

2, እንዴት ነው ሂሳብ ምሞላው?
         ⨳ ሂሳብ ለመሙላት /buy ብለው በመላክ የሚመጡላቹን መመሪያዎች በትክክል በመፈፀም መሙላት ይችላሉ!

3, በነፅ ፊልም ማግኘት ይቻላል?
         ⨳ አዎ በሚገባ ይችላሉ ፤ በነፃ ፊልም ለማግኘት ከቦቱ በሚሰጣቹ መጋበዣ ሊንክ  ወዳጅ ዘመዶን በመጋበዝ ነፅ ፊልም መኮምኮም ይችላሉ!"""
    INSTRUCTION = """..
    ..
    ..
    ......."""
    
  
